Revit 2027 API
PromptForFamilyInstancePlacementOptions.PlaceAirTerminalOnDuct Property
 If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings. If fase, the terminal will be placed with generated fittings.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PlaceAirTerminalOnDuct { get; set; }
Public Property PlaceAirTerminalOnDuct As Boolean
	Get
	Set
public:
property bool PlaceAirTerminalOnDuct {
	bool get ();
	void set (bool value);
}
member PlaceAirTerminalOnDuct : bool with get, set
Property Value
Boolean
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace